Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/before_a_death/making_a_will.html.txt.tmx
Source language: en
Languages: ga

source: • One-third of your estate if you do have children
ga: Bíonn iachall ar sheiceadóir ar bith an chuid sin a cheadú nuair a bhíonn sé oiriúnach

source: Your spouse/civil partner does not have to go to court to get this share, as any executor is obliged to grant this share where applicable
ga: Is féidir leat tiomnacht a dhéanamh i d'uacht a mhéadaíonn cuid cheart dhlíthiúil do chéile/páirtnéir sibhialta

source: You can also make a bequest in your will that increases your spouse's/civil partner's legal right share, although if you do not specify that this gift is meant to be in addition to his/her legal right share, the executor may consider it part of that share and not an extra element to it
ga: Muna leagann tú síos go bhfuil an chuid seo ceapaithe a bheith ann chomh maith lena c(h)uid cheart dhlíthiuil, d'fhéadfadh an seiceadóir í a thuiscint mar chuid den chuid sin in áit í a thuiscint mar eilimint bhreise

source: Your spouse/civil partner can choose to take either the assets specified under the will or his/her legal right share
ga: Bheadh an rogha ag do chéile/páirtnéir sibhialta na maoine ainmnithe san uacht nó a c(h)uid cheart dhlíthiúil

source: The executors must inform your spouse/civil partner in writing of his or her right to choose between these two options and your spouse/civil partner must exercise this right within 6 months of receipt of notification or within 12 months of the taking out of the Grant of Representation
ga: a thógáil. Beidh ar na seiceadóirí do chéile/páirtnéir sibhialta a chur ar an eolas i scríbhinn maidir lena c(h)eart chun rogha a dhéanamh idir an dá rud, agus beidh ar do chéile an rogha seo a dhéanamh taobh istigh de 6 mhí ón dáta a fhaigheann sé/sí an fógra, nó taobh istigh de 12 mhí ón am a fuarthas an Deonú Ionadaíochta

source: Renouncing or losing rights under a will
ga: Cearta a thréigean nó a chailleadh faoi uacht

source: It is possible for a spouse/civil partner to renounce his/her rights to the legal right share
ga: Is féidir le céile/páirtnéir sibhialta a c(h)earta don chuid cheart dhlíthiúil a thréigean

source: This can form part of an agreement prior to marriage/civil partnership, for example, in the case of a second marriage, or the spouse/civil partner may set aside his or her rights in order to favour any children
ga: D'fhéadfadh sé seo a bheith mar chuid de chomhaontú roimh phósadh/páirtnéireacht shibhialta, mar shampla i gcás an dara pósadh, nó is féidir le céile/páirtnéir sibhialta a c(h)earta a chur i leataobh chun tairbhe páistí áirithe

source: However, any such renunciation may be ignored in certain circumstances, for example, if there is evidence of undue influence or evidence that the spouse/civil partner did not understand what he/she was doing or did not have independent legal advice
ga: Féadfar an tréigean sin a dhiúltú, áfach, mar shampla má tá fianaise ann go raibh tionchar míchuí i gceist, nó fianaise nár thuig an céile céard a bhí á dhéanamh aige/aici, nó nach raibh comhairle dlí neamhspleách aige/aici

source: If a couple is separated, a renunciation of each other's right to the legal right share is usually included in a separation agreement
ga: Má bhíonn lánúin scartha óna chéile, de ghnáth bíonn tréigean na coda cirte dlíthiúla mar chuid de chomhaontú scartha

source: Divorce or dissolution of a civil partnership, however, automatically ends succession rights
ga: Cuireann colscaradh nó páirtnéireacht shibhialta a dhíscaoileadh deireadh go huathoibríoch le cearta oidreachta

source: Cohabiting partners have no automatic legal right to each other's estates, although under the redress scheme for cohabiting couples introduced by the Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010 a qualified cohabitant may apply for provision to be made from the estate of a deceased cohabitant
ga: Ní bhíonn cearta uathoibríocha ag páirtithe comhchónaithe d'eastáit a chéile, cé faoin scéim sásaimh do lánúineacha comhchónaithe a tugadh isteach leis an tAcht um Páirtnéireacht Shibhialta agus um Chearta agus Oibleagáidí Áirithe de chuid Comhchónaitheoirí 2010 féadfaidh comhchónaitheoir cáilithe iarratas a dhéanamh ar sholáthar le déanamh as eastát an éagaigh comhchónaitheoir

source: Cohabiting partners can make wills that favour each other
ga: Is féidir le páirtithe comhchónaithe a dhéanamh uachtanna go bhfabhar chéile

source: These wills, however, cannot cancel out the legal rights of a spouse/civil partner if someone is separated but not divorced or their civil partnership dissolved
ga: Ní féidir leis na huachtanna seo, áfach, cearta dlíthiúla céile/páirtnéir sibhialta a chur ar ceal má tá duine scartha, ach gan a bheith colscartha nó páirtnéireacht shibhialta dhíscaoilte

source: Being judged "unworthy to succeed" is relatively rare, and would arise, for example, if the surviving spouse/civil partner had murdered or committed certain other serious crimes against the deceased
ga: Is réasúnta annamh a mheastar "nach bhfuiltear inchurtha leis an oidreacht" agus tharlódh sé dá dhúnmharódh an céile/páirtnéir sibhialta a mhaireann an duine marbh, nó dá ndéanfadh sé/sí coireanna tromchúiseacha eile ina (h)aghaidh

source: It could also apply if the spouse/civil partner had deserted the deceased for at least two years before death
ga: D'fhéadfadh sé a bheith i gceist chomh maith dá dtréigfeadh an céile/páirtnéir sibhialta an duine marbh ar feadh dhá bhliain ar a laghad roimh a b(h)ás

source: Rights of children under a will
ga: Cearta páistí de réir uachta

source: Unlike a spouse/civil partner, children do not have any absolute right to inherit their parent's estate if the parent has made a will
ga: Éagsúil le cearta an chéile/páirtnéir sibhialta, ní bhíonn ceart leithleach ag páistí teacht in oidreacht ar eastát a dtuismitheora, má rinne an tuismitheoir uacht

source: Children born inside or outside marriage and adopted children all have the same rights and there are no age restrictions
ga: Bíonn na cearta céanna ag páistí a rugadh taobh istigh nó taobh amuigh de phósadh agus ag uchtpháistí agus ní bhíonn teorainneacha aoise i gceist

source: However, a child may make an application to court if he/she feels that he/she has not been adequately provided for
ga: D'fhéadfadh páiste, áfach, iarratas a dhéanamh chuig an chúirt má cheapann sé/sí nár soláthraíodh dó/di i gceart

source: It is important to seek legal advice before making such an application
ga: Bíonn sé tábhachtach comhairle dlíthiúil a fháil sula ndéantar iarratas mar sin

source: An application must be made within 6 months of the taking out of a Grant of Representation
ga: Ní foláir iarratas a dhéanamh taobh istigh de 6 mhí ón am a fuarthas Deonú Ionadaíochta

source: The court then has to decide if the parent has failed in his/her duty to the child in accordance with the needs of that child
ga: Bíonn ar an gcúirt ansin cinneadh a dhéanamh an bhfuil faillí déanta ag an tuismitheoir ar an bpáiste de réir riachtanais an pháiste sin

source: Each case is considered individually, but it is important to remember that the legal right share of the spouse cannot be infringed in order to give the child a greater share of the estate. It can, however, reduce the entitlement of a civil partner
ga: Scrúdaítear gach cás ar leith, ach tá sé tábhachtach a mheabhrú nach féidir cuid cheart dhlíthiúil an chéile a sharú chun cuid níos mó den eastát a thabhairt don pháiste.Is féidir é, áfach, laghdú ar an teideal atá ag páirtnéir sibhialta

source: The surviving spouse/civil partner may require that the family/shared home be given to him/her in satisfaction of his/her legal right share, although if the house is worth more than the legal right share, the spouse/civil partner may have to pay the difference into the deceased's estate
ga: D'fhéadfadh an céile/páirtnéir sibhialta a mhaireann teach an teaghlaigh a éileamh chun a c(h)uid cheart dhlíthiúil a shásamh. Má tá luach an tí níos mó ná an chuid cheart dhlíthiúil, áfach, b'fhéidir go mbeidh ar an gcéile/páirtnéir sibhialta an difríocht idir an dá rud a íoc isteach in eastát an duine mhairbh

source: A court may decide that this sum does not have to be paid if it would cause undue hardship to the spouse/civil partner or dependent children
ga: D'fhéadfadh cúirt cinneadh a dhéanamh nach gcaithfear an tsuim seo a íoc dá gcuirfeadh sé cruatan míchuí ar an gcéile/páirtnéir sibhialta nó ar pháistí cleithiúnacha

source: Giving away property in order to disinherit
ga: Maoin a thabhairt uait chun duine a chur as oidhreacht

source: If a court finds that the deceased person gave away property before he/she died with the intention of defeating the interest of or unfairly reducing the legal right share of a spouse/civil partner or child, a court order may be issued to the person who received the property, making that person a debtor of the estate, and requiring them to pay back an amount to the estate
ga: Má mheasann cúirt gur thug an duine marbh maoin uaidh/uaithi sula bhfuair sé/sí bás chun leas céile/páirtnéir sibhialta nó páiste a shárú nó a gcuid cheart dhlíthiúil a laghdú go héagórach, is féidir ordú cúirte a eisiúnt don duine a fuair an mhaoin ag déanamh fiachóra de chuid an eastáit de/di agus ag cur iachaill air/uirthi méid áirithe a aisíoc don eastát

source: Remember that any legacy or gift in your will could fail for many reasons
ga: Meabhraigh gur féidir le tiomnacht nó bronntanas ar bith i d'uacht a chliseadh ar go leor fáthanna

source: • If your will states that you are leaving an asset to someone and you no longer have the asset or the asset no longer exists, then the gift fails, or is in ademption
ga: • Má deir d'uacht go bhfuil tú ag fágáil maoine ag duine, agus muna bhfuil an mhaoin sin agat níos mó, nó muna bhfuil an mhaoin sin ar an saol níos mó, cliseann an bronntanas, nó bíonn sé i seachsásamh

source: • If you leave a gift to a person who is a witness to your will
ga: • Má fhágann tú bronntanas ag duine atá ina fhinné do d'uacht

source: • If the gift is not clearly identified in your will or it does not conform to its description in the will
ga: • Muna bhfuil cur síos soiléir ar an mbronntanas i d’uacht nó muna réitíonn sé leis an gcur síos atá san uacht

source: • Your gift lapses, or no longer applies, if the beneficiary dies before you do
ga: • Titeann do bhronntanas ar lár, nó ní bhíonn feidhm aige níos mó, má fhaigheann an dílseánach beinifíse bás romhat

source: If this happens or if the beneficiary refuses to accept the gift, your gift goes back to your residuary clause, or if you do not have one a residuary clause, into intestacy
ga: Má tharlaíonn sé seo, nó má dhiúltaíonn an dílseánach beinifíse do bhronntanas, téann do bhronntanas ar ais go dtí do chlásál iarmharach, nó muna bhfuil ceann agat, go díthiomnacht

source: Your gift will not lapse, however, if the beneficiary who dies is a child or other descendant of yours, such as a grandchild, but whose child (or other descendant) is still alive
ga: Ní thitfidh do bhronntanas ar lár, áfach, má tá an tairbhí a fhaigheann bás linbh nó shliocht eile de do chuid, mar shampla ua nó banua, ach tá a leanbh (nó shliocht eile) fós beo

source: In that case, the gift becomes part of your deceased beneficiary’s estate for distribution according to their will or intestacy
ga: Sa chás sin, beidh an bronntanas chuid d'eastát an tairbhí éagaigh agus tá sé dháileadh de réir a uacht nó díthiomnacht

source: How wills are interpreted
ga: An chaoi a mbaintear ciall as uachtanna

source: Most wills are not disputed, but if there is a disagreement, it must be settled in court
ga: Ní dhéantar agóid i gcoinne an chuid is mó d'uachtanna, ach má tá easaontas ann, caithfear é a réiteach sa chúirt

source: The court will give effect to the testator or will-maker's wishes as expressed in the will
ga: Cuirfidh an chúirt toil an tiomnóra nó an duine a rinne an uacht i gcrích mar a cuireadh in iúl í san uacht

source: The testator's wishes are derived or taken from a reading of the will as a whole, with words and phrases taken in their ordinary meaning unless they are technical words and it can be assumed the testator meant them to be taken in their technical meaning
ga: Díorthaítear, nó tόgtar, toil an tiomnóra ó léamh na huachta go hiomlán, ag miniú focal agus frásaí lena ngnáthchiall munar focail theicniúla iad agus más féidir glacadh leis go raibh an tiomnóir ag súil go mbainfí a gciall theicniúil astu

source: Extrinsic evidence, or evidence outside the will, such as letters or notes that refer to the will in advance of its making, may be introduced to the court to explain more fully the testator's intentions and to help ascertain the true meaning of the will
ga: Is féidir fianaise eistreach, nó fianaise taobh amuigh den uacht, mar litreacha nó nótaí a thagraíonn don uacht sula ndearnadh í, a chur os comhair na cúirte chun rún an tiomnóra a mhiniú agus ciall cheart na huachta a bhaint amach

source: Where two interpretations of a provision in the will arise, the court will lean in favour of the interpretation that upholds that bequest
ga: Má thagann dhá mhíniú éagsúla d'fhoráil san uacht chun solais, beidh claonadh ag an gcúirt a bheith i bhfabhar an mhínithe a thacaíonn leis an tiomnacht sin

source: Because wills can be disputed, it is important that you write your will in simple, straightforward language
ga: Ós rud é gur féidir agóid a dhéanamh i gcoinne uachtanna, tá sé tábhachtach go scríobhann tú d'uacht i dteanga shimplí, dhíreach

source: If you have property in other countries, it is generally considered advisable to make a will in each of those countries due to possible differences in succession law
ga: Má bhíonn maoin agat i dtíortha eile, is gnách go meastar gur fearr duit uacht a dhéanamh i ngach ceann de na tíortha siúd mar gheall go bhféadfadh difríochtaí a bheith ann sa dlí comharbais

source: Under EU Regulation 650/2012 on matters of succession (Brussels IV), if you have property in another EU member state, apart from the UK or Denmark, you can direct in your will that the law of your nationality should apply to the property
ga: Faoi Rialachán 650/2012 maidir le ceisteanna comharbais (an Bhruiséil IV), má bhíonn maoin agat i mballstát eile an AE, seachas an RA nó an Danmhairg, féadfaidh tú a ordú i d’uacht gur cheart go mbainfeadh dlí do náisiúntachta leis an maoin

source: Status of wills as public documents
ga: Stádas uachtanna mar cháipeisí poiblí

source: After probate has been taken out on a person's will, that will then becomes a public document and a copy of the grant and the will can be obtained by anyone from the Probate Office or relevant District Probate Registry using Form PAS1 (pdf)
ga: I ndiaidh gur glacadh probháid ar uacht duine, déanfar cáipéis phoiblí ansin di agus is féidir le duine ar bith ón Oifig Probháide nó ón gClárlann ábhartha Phrobháide Cheantair cóip den deonú agus den uacht trí Fhoirm PAS1 (pdf) a úsáid

source: The grant sets out the name and address of the executor or administrator of the estate and the name of the solicitor acting on their behalf (if any)
ga: Leagtar amach sa deonú ainm agus seoladh sheiceadóir nó riarthóir an eastáit agus ainm an aturnae a ghníomhaíonn thar a gceann (más ann dó/di)

source: It also sets out the gross value and the net value of the estate
ga: Leagtar amach ann, chomh maith, oll-luach agus glanluach an eastáit

source: Detailed information about the estate is not normally available to the general public, however, certain people may be able to inspect the Inland Revenue Affidavit which contains the detailed information
ga: Ní gnách go mbíonn faisnéis mhionsonraithe ar fáil don phobal i gcoitinne faoin eastát, ach b’fhéidir go mbeidh daoine áirithe in ann an Mhionscríbhinn Ioncam Intíre a scrúdú, áfach, ina gcuimsítear an fhaisnéis mhionsonraithe

source: • A beneficiary who is named in the will
ga: • Tairbhí atá ainmnithe san uacht

source: • Someone who is entitled to a share of the estate
ga: • Duine éigin atá i dteideal sciar den eastát a fháil

source: • A child who is entitled to bring proceedings against the estate under Section 117 of the Succession Act 1965
ga: • Leanbh atá i dteideal imeachtaí a thionscnamh i gcoinne an eastáit faoi Alt 117 den Acht Comharbais, 1965

source: Information on obtaining a copy of a will is available on the Courts Service website as well as in the information notes of Form PAS1
ga: Tá faisnéis ar chóip d’uacht a fháil ar fáil ar láithreán gréasáin na Seirbhíse Cúirteanna, anuas ar nótaí faisnéise Fhoirm PAS1

source: The Probate Office also sends copies of the will, the Grant of Representation and the Inland Revenue Affidavit to the Revenue Commissioners
ga: Chomh maith leis sin, seolann an Oifig Probháide cóipeanna den uacht, an Deonú Ionadaíochta agus an Mhionnscríbhinn Ioncam Intíre chuig na Coimisinéirí Ioncaim

source: Joint bank accounts or joint ownership of property are valid ways of deciding the fate of your assets in your own lifetime, but making a will can eliminate most potential disputes
ga: Is bealaí bailí iad comhchuntais bainc, nó comhúinéaracht maoine chun a bhfuil i ndán do do shócmhainní a réiteach i rith do shaoil, ach dibríonn uacht an chuid is mó de na haighnis a d'fhéadfadh a tharlú

source: Where joint bank accounts are opened with a spouse/civil partner or child, it is presumed that one party will be fully entitled to the money in the account when the other party dies
ga: Nuair a osclaítear comhchuntas bainc le céile nó páiste, glactar leis go mbeidh páirtí amháin i dteideal iomlán an airgid sa chuntas nuair a fhaigheann an páirtí eile bás

source: Disputes can arise, however, if someone, perhaps an elderly person or a person with a physical disability, opens a joint bank account with a relative or friend so that the relative or friend can manage his or her finances for him or her
ga: D'fhéadfadh aignis a tharlú, áfach, má osclaíonn duine, b'fhéidir duine scothaosta nó duine le míchumas fisiciúil, chomhchuntas bainc in éineacht le gaol nó le cara ionas go mbeidh an gaol nó an cara in ann a g(h)nó airgeadais a dhéanamh ar a s(h)on

source: This is because the owner's intention may or may not have been to benefit the relative or friend
ga: Tarlaíonn sé seo mar ní gá go raibh leas an ghaoil nó an charad i gceist ag an úinéir

source: A decision in such a case would depend on the intention of the people involved, the amount they each lodged into the account and the terms of their contract with the bank
ga: Bhraithfeadh cinneadh i gcás mar sin ar rún na ndaoine atá i gceist, an méid airgid a chuir gach duine acu sa chuntas agus téarmaí a gconartha leis an mbanc

source: It is advisable for people with joint accounts to make clear in their contract with their bank or in their will what their intentions are for the money in such accounts
ga: Moltar do dhaoine le chomhchuntais céard atá i gceist acu maidir leis an airgead i gcuntais mar sin a leagan amach go soiléir ina gconarthaí leis an mbanc nó ina n-uachtanna

source: A solicitor will be able to help you draft a will or you can write it yourself
ga: Bheadh dlíodóir in ann cábhrú leat chun uacht a dhréachtadh, nó is féidir leat é a dhéanamh tú féin

source: If you are an executor seeking probate, you may make a personal application for a grant of probate to the Probate Office or to one of 14 District Probate Registry offices
ga: Más seiceadóir tú atá ag cuartú probháide, is féidir leat iarratas pearsanta a dhéanamh ar dheonú probháide chuig an Oifig Phrobháide nó chuig ceann de na ceithre cinn déag de Chlárlanna Probháide Dúiche

source: You should go to the District Probate Registry Office in the area where the deceased lived at the date of death
ga: Ba cheart duit dul chuig an gClárlann Phrobháide Dhúiche sa cheantar ina raibh an duine marbh ina c(h)ónaí ag dáta an bháis

source: If the deceased lived at the time of his or her death in Dublin, Meath, Kildare or Wicklow or lived outside Ireland, application for a grant of probate must be made to the Probate Office in Dublin
ga: Má bhí an duine marbh ina c(h)ónaí i mBaile Átha Cliath, Contae na Mí, Cill Dara nó taobh amuigh d'Éirinn ag am a b(h)áis, ní foláir iarratas ar dheonú probháide a dhéanamh chuig an Oifig Phrobháide i mBaile Átha Cliath
